### Terraform Plan 📋
**Environment:** `dev`
**Result:** `success`

<details><summary>Show Plan</summary>

```terraform
module.eks.data.aws_caller_identity.current: Reading...
module.alb_controller.data.aws_caller_identity.current: Reading...
module.alb_controller.data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.alb_controller.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.security.data.aws_caller_identity.current: Reading...
module.alb_controller.data.aws_caller_identity.current: Read complete after 0s [id=992382750905]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=992382750905]
module.security.data.aws_caller_identity.current: Read complete after 0s [id=992382750905]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # helm_release.metrics_server will be created
  + resource "helm_release" "metrics_server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "3.12.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "replicas"
          + value = "2"
            # (1 unchanged attribute hidden)
        }
    }

  # module.alb_controller.aws_iam_policy.alb_controller will be created
  + resource "aws_iam_policy" "alb_controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for AWS Load Balancer Controller"
      + id               = (known after apply)
      + name             = "eks-portfolio-Dev-alb-controller-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "ec2:DescribeVpcEndpoints",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeTrustStores",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all         = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
    }

  # module.alb_controller.aws_iam_role.alb_controller will be created
  + resource "aws_iam_role" "alb_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-portfolio-Dev-alb-controller-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.alb_controller.aws_iam_role_policy_attachment.alb_controller will be created
  + resource "aws_iam_role_policy_attachment" "alb_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-portfolio-Dev-alb-controller-role"
    }

  # module.alb_controller.helm_release.alb_controller will be created
  + resource "helm_release" "alb_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.10.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "eks-portfolio-Dev"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "region"
          + value = "eu-west-1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "replicaCount"
          + value = "2"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "vpcId"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.eks will be created
  + resource "aws_cloudwatch_log_group" "eks" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/eks/eks-portfolio-Dev/cluster"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-1"
      + retention_in_days           = 90
      + skip_destroy                = false
      + tags                        = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all                    = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
    }

  # module.eks.aws_eks_access_entry.admin will be created
  + resource "aws_eks_access_entry" "admin" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-portfolio-Dev"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:sts::992382750905:assumed-role/github-actions-eks-project/GitHubActions"
      + region            = "eu-west-1"
      + tags              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all          = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.admin will be created
  + resource "aws_eks_access_policy_association" "admin" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-portfolio-Dev"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:sts::992382750905:assumed-role/github-actions-eks-project/GitHubActions"
      + region        = "eu-west-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_cluster.this will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "eks-portfolio-Dev"
      + platform_version              = (known after apply)
      + region                        = "eu-west-1"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all                      = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + version                       = "1.29"

      + access_config (known after apply)

      + compute_config (known after apply)

      + control_plane_scaling_config (known after apply)

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config (known after apply)

      + storage_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.this will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks-portfolio-Dev"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t4g.medium",
        ]
      + labels                 = {
          + "environment" = "Dev"
          + "role"        = "general"
        }
      + node_group_name        = "eks-portfolio-Dev-default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + region                 = "eu-west-1"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "CostCenter"                                  = "development"
          + "Environment"                                 = "Dev"
          + "ManagedBy"                                   = "terraform"
          + "Owner"                                       = "constantinious"
          + "Project"                                     = "eks-portfolio"
          + "Service"                                     = "eks-platform"
          + "Team"                                        = "platform"
          + "k8s.io/cluster-autoscaler/eks-portfolio-Dev" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"           = "true"
        }
      + tags_all               = {
          + "CostCenter"                                  = "development"
          + "Environment"                                 = "Dev"
          + "ManagedBy"                                   = "terraform"
          + "Owner"                                       = "constantinious"
          + "Project"                                     = "eks-portfolio"
          + "Repository"                                  = "eks-portfolio-project"
          + "Service"                                     = "eks-platform"
          + "Team"                                        = "platform"
          + "k8s.io/cluster-autoscaler/eks-portfolio-Dev" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"           = "true"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 5
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_iam_openid_connect_provider.eks will be created
  + resource "aws_iam_openid_connect_provider" "eks" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-oidc-provider"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all        = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-oidc-provider"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_role.cluster_autoscaler[0] will be created
  + resource "aws_iam_role" "cluster_autoscaler" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-portfolio-Dev-cluster-autoscaler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role.eks_cluster will be created
  + resource "aws_iam_role" "eks_cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-portfolio-Dev-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role.eks_nodes will be created
  + resource "aws_iam_role" "eks_nodes" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-portfolio-Dev-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all              = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role_policy.cluster_autoscaler[0] will be created
  + resource "aws_iam_role_policy" "cluster_autoscaler" {
      + id          = (known after apply)
      + name        = "eks-portfolio-Dev-cluster-autoscaler-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeScalingActivities",
                          + "autoscaling:DescribeTags",
                          + "ec2:DescribeImages",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:GetInstanceTypesFromInstanceRequirements",
                          + "eks:DescribeNodegroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:ResourceTag/k8s.io/cluster-autoscaler/eks-portfolio-Dev" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-portfolio-Dev-cluster-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-portfolio-Dev-node-group-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_container_registry_read will be created
  + resource "aws_iam_role_policy_attachment" "eks_container_registry_read" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-portfolio-Dev-node-group-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_ssm_managed_instance will be created
  + resource "aws_iam_role_policy_attachment" "eks_ssm_managed_instance" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "eks-portfolio-Dev-node-group-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_vpc_resource_controller will be created
  + resource "aws_iam_role_policy_attachment" "eks_vpc_resource_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-portfolio-Dev-cluster-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_worker_node_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-portfolio-Dev-node-group-role"
    }

  # module.eks.aws_launch_template.eks_nodes will be created
  + resource "aws_launch_template" "eks_nodes" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "eks-portfolio-Dev-nodes-"
      + region          = "eu-west-1"
      + tags            = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all        = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination      = "true"
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + kms_key_id                 = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 30
              + volume_type                = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "CostCenter"  = "development"
              + "Environment" = "Dev"
              + "ManagedBy"   = "terraform"
              + "Name"        = "eks-portfolio-Dev-worker-node"
              + "Owner"       = "constantinious"
              + "Project"     = "eks-portfolio"
              + "Service"     = "eks-platform"
              + "Team"        = "platform"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "CostCenter"  = "development"
              + "Environment" = "Dev"
              + "ManagedBy"   = "terraform"
              + "Name"        = "eks-portfolio-Dev-worker-volume"
              + "Owner"       = "constantinious"
              + "Project"     = "eks-portfolio"
              + "Service"     = "eks-platform"
              + "Team"        = "platform"
            }
        }
    }

  # module.security.aws_kms_alias.ebs will be created
  + resource "aws_kms_alias" "ebs" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks-portfolio-Dev-ebs"
      + name_prefix    = (known after apply)
      + region         = "eu-west-1"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.security.aws_kms_alias.eks will be created
  + resource "aws_kms_alias" "eks" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks-portfolio-Dev-eks"
      + name_prefix    = (known after apply)
      + region         = "eu-west-1"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.security.aws_kms_key.ebs will be created
  + resource "aws_kms_key" "ebs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for EBS encryption - eks-portfolio-Dev"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + region                             = "eu-west-1"
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-ebs-kms"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all                           = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-ebs-kms"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
    }

  # module.security.aws_kms_key.eks will be created
  + resource "aws_kms_key" "eks" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for EKS secrets encryption - eks-portfolio-Dev"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::992382750905:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:DescribeKey",
                          + "kms:CreateGrant",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow EKS to use the key"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "eu-west-1"
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-eks-kms"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all                           = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-eks-kms"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
    }

  # module.security.aws_security_group.eks_cluster will be created
  + resource "aws_security_group" "eks_cluster" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS cluster control plane"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "eks-portfolio-Dev-eks-cluster-"
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-eks-cluster-sg"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all               = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-eks-cluster-sg"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security.aws_security_group.eks_nodes will be created
  + resource "aws_security_group" "eks_nodes" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS worker nodes"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "eks-portfolio-Dev-eks-nodes-"
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"                              = "development"
          + "Environment"                             = "Dev"
          + "ManagedBy"                               = "terraform"
          + "Name"                                    = "eks-portfolio-Dev-eks-nodes-sg"
          + "Owner"                                   = "constantinious"
          + "Project"                                 = "eks-portfolio"
          + "Service"                                 = "eks-platform"
          + "Team"                                    = "platform"
          + "kubernetes.io/cluster/eks-portfolio-Dev" = "owned"
        }
      + tags_all               = {
          + "CostCenter"                              = "development"
          + "Environment"                             = "Dev"
          + "ManagedBy"                               = "terraform"
          + "Name"                                    = "eks-portfolio-Dev-eks-nodes-sg"
          + "Owner"                                   = "constantinious"
          + "Project"                                 = "eks-portfolio"
          + "Repository"                              = "eks-portfolio-project"
          + "Service"                                 = "eks-platform"
          + "Team"                                    = "platform"
          + "kubernetes.io/cluster/eks-portfolio-Dev" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security.aws_vpc_security_group_egress_rule.eks_cluster_all will be created
  + resource "aws_vpc_security_group_egress_rule" "eks_cluster_all" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
        }
    }

  # module.security.aws_vpc_security_group_egress_rule.eks_nodes_all will be created
  + resource "aws_vpc_security_group_egress_rule" "eks_nodes_all" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
        }
    }

  # module.security.aws_vpc_security_group_ingress_rule.eks_cluster_https will be created
  + resource "aws_vpc_security_group_ingress_rule" "eks_cluster_https" {
      + arn                          = (known after apply)
      + description                  = "Allow HTTPS from worker nodes"
      + from_port                    = 443
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "eu-west-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
        }
      + to_port                      = 443
    }

  # module.security.aws_vpc_security_group_ingress_rule.eks_nodes_cluster will be created
  + resource "aws_vpc_security_group_ingress_rule" "eks_nodes_cluster" {
      + arn                          = (known after apply)
      + description                  = "Allow control plane to communicate with nodes"
      + from_port                    = 1025
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "eu-west-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
        }
      + to_port                      = 65535
    }

  # module.security.aws_vpc_security_group_ingress_rule.eks_nodes_cluster_https will be created
  + resource "aws_vpc_security_group_ingress_rule" "eks_nodes_cluster_https" {
      + arn                          = (known after apply)
      + description                  = "Allow control plane to communicate with nodes on 443"
      + from_port                    = 443
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "eu-west-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
        }
      + to_port                      = 443
    }

  # module.security.aws_vpc_security_group_ingress_rule.eks_nodes_self will be created
  + resource "aws_vpc_security_group_ingress_rule" "eks_nodes_self" {
      + arn                          = (known after apply)
      + description                  = "Allow node-to-node communication"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + region                       = "eu-west-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
        }
    }

  # module.vpc.aws_cloudwatch_log_group.flow_log[0] will be created
  + resource "aws_cloudwatch_log_group" "flow_log" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/vpc-flow-log/eks-portfolio-Dev"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-1"
      + retention_in_days           = 30
      + skip_destroy                = false
      + tags                        = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-flow-log-group"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all                    = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-flow-log-group"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "eu-west-1"
      + tags                 = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-nat-eip-1"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Service"     = "eks-platform"
          + "Team"        = "platform"
        }
      + tags_all             = {
          + "CostCenter"  = "development"
          + "Environment" = "Dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "eks-portfolio-Dev-nat-eip-1"
          + "Owner"       = "constantinious"
          + "Project"     = "eks-portfolio"
          + "Repository"  = "eks-portfolio-project"
          + 

... (truncated)
```

</details>

*Pushed by: @constantinious*